
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/paaaaay5/terraform-ecs/actions/runs/5796731629)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0157a5649b2123617]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0511538431383fdaa]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-01996f1e56d9e5a2f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-006145e36e39b1c48]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0914e5fb0f3aa1053]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05d9cce52017c998c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a6c2bd59bf6d02c2]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07129185ac01a5f47]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01a7e3a43a003a4cc]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00a08173e1848e10b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-030e23fff230102c4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0312b53d701b3a36f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01a7e3a43a003a4cc1080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b29f0f2fe8209f16]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02d9323927f7034ce]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01476c50ae92d1684]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05c59bea5a5eec2be]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01aaf207c05919842]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01c0e92fa222a8113]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e68ab255b3ad7791]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-090bcbb028c1df6a1]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-030e23fff230102c41080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0312b53d701b3a36f1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-0157a5649b2123617"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-0157a5649b2123617"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.alb: Creating...
aws_security_group.ecs: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-0be6476e5b23a7d6e]
aws_security_group.alb: Creation complete after 4s [id=sg-05d7e6d822fc58988]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-1827683724]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"63a5525f3747cb433ca2bd2068d9f806fea0fb80","Vars":{},"WorkflowName":"Terraform-CICD"} -->